KCX-Mapping-Convert/testdaten/EMCS-V20/UidsFromKids/EMCSAlertOrRejection.xml

<?xml version="1.0" encoding="UTF-8"?><soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope"><soap:Header><Header xmlns="http://www.eurtradenet.com/schemas/header/200310" soap:mustUnderstand="true"><To>DE01.CSFALT.2144</To><From>DE.CSF</From><MessageID>EI20100519</MessageID><SentAt>2010-05-19 12:02:00 +0200</SentAt><Act>request</Act><Method>EMB</Method><MessageVersion>2.0</MessageVersion></Header></soap:Header><soap:Body><Submit xmlns="http://www.eurtradenet.com/schemas/uids/emcs/body/200911"><EMCS><EMCSAlertOrRejection><LocalReferenceNumber>IWA-20110812-001</LocalReferenceNumber><AadReferenceCode>aaRC</AadReferenceCode><SequenceNumber>1</SequenceNumber><DestinationOffice>dst</DestinationOffice><DateAndTimeOfValidation>2011-08-11T11:22:00+0200</DateAndTimeOfValidation><RejectedFlag>rFlag</RejectedFlag><DateOfAlertOrRejection>2011-08-10T09:08:00+0200</DateOfAlertOrRejection><ConsigneeTrader><CustomerID>CustomerID</CustomerID><VATID>VATID</VATID><Address><Name>Name</Name><Street>StreetAndNumber</Street><StreetNumber>1ce</StreetNumber><PostalCode>PostalCode</PostalCode><City>City</City><Language>DE</Language></Address></ConsigneeTrader><AlertOrRejectionReasons><ReasonCode>10</ReasonCode><ReasonCode>11</ReasonCode></AlertOrRejectionReasons></EMCSAlertOrRejection></EMCS></Submit></soap:Body></soap:Envelope>
